# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: '/Applications'

# Utilities
brew 'git'
brew 'tig'
brew 'hub'
brew 'zsh'
brew 'zsh-completion'
brew 'bash-completion'
brew 'rg'
brew 'wget'
brew 'z'
brew 'gnu-getopt'
tap 'neovim/neovim'
brew 'neovim'

# Operations
brew 'kubectl'
brew 'helm'
brew 'helmfile'

brew 'terraform'
brew 'awscli'
brew 'docker'

# Programming Languages
brew 'go'
brew 'node'
brew 'typescript'
brew 'clojure'
brew 'clojurescript'
brew 'python'
brew 'python3'

# Applications
cask 'iterm2'
cask '1password'
cask 'istat-menus'
cask 'dropbox'
cask 'brave-browser'
cask 'alfred'
cask 'flux'
cask 'slack'
cask 'zoom'
cask 'spotify'
