# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: '/Applications'

# Shell
brew 'htop'
brew 'tmux'
brew 'zsh'
brew 'zsh-completion'
brew 'bash-completion'
brew 'wget'
brew 'z'
brew 'mas'

# Editing
brew 'git'
brew 'tig'
brew 'hub'
brew 'fzf'
brew 'rg'
tap 'neovim/neovim'
brew 'neovim'

# fun
brew 'sl'

# Operations
brew 'kubectl'
brew 'helm'
brew 'helmfile'
brew 'gnu-getopt'
brew 'certbot'
brew 'circleci'
brew 'sops'
brew 'velero'

brew 'warrensbox/tap/tfswitch'
brew 'terraform'
brew 'awscli'
brew 'minikube'
cask 'docker'

# Programming Languages
brew 'go'
brew 'node'
brew 'typescript'
brew 'clojure'
brew 'clojurescript'
brew 'python'
brew 'python3'

# Applications
cask 'iterm2'
cask '1password'
cask 'dropbox'
cask 'brave-browser'
cask 'firefox'
cask 'alfred'
cask 'flux'
cask 'slack'
cask 'zoom'
cask 'spotify'

mas "iStat Menus", id: 1319778037
mas "OmmWriter", id: 412347921
mas "Things", id: 904280696
